In [1]:
import pandas as pd
df = pd.read_csv('Coding/WSA/merged_files.csv')
df.head()

,Unnamed: 0,match_id,season,start_date,venue,innings,ball,batting_team,bowling_team,striker,...,bowler,runs_off_bat,extras,wides,noballs,byes,legbyes,penalty,wicket_type,player_dismissed
0,0,211028,2005,2005-06-13,The Rose Bowl,1,0.1,England,Australia,ME Trescothick,...,B Lee,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,211028,2005,2005-06-13,The Rose Bowl,1,0.2,England,Australia,ME Trescothick,...,B Lee,1,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,211028,2005,2005-06-13,The Rose Bowl,1,0.3,England,Australia,GO Jones,...,B Lee,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,3,211028,2005,2005-06-13,The Rose Bowl,1,0.4,England,Australia,GO Jones,...,B Lee,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4,211028,2005,2005-06-13,The Rose Bowl,1,0.5,England,Australia,GO Jones,...,B Lee,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [2]:
df['batting_team'].unique()

array(['England', 'Australia', 'New Zealand', 'South Africa', 'Pakistan',
       'Sri Lanka', 'West Indies', 'India', 'Kenya', 'Scotland',
       'Zimbabwe', 'Bangladesh', 'Bermuda', 'Netherlands', 'Ireland',
       'Afghanistan', 'Canada', 'Nepal', 'Hong Kong',
       'United Arab Emirates', 'Papua New Guinea', 'Oman', 'ICC World XI',
       'Philippines', 'Vanuatu', 'United States of America', 'Germany',
       'Italy', 'Ghana', 'Namibia', 'Uganda', 'Botswana', 'Nigeria',
       'Guernsey', 'Denmark', 'Norway', 'Jersey', 'Thailand', 'Malaysia',
       'Maldives', 'Singapore', 'Qatar', 'Kuwait', 'Cayman Islands',
       'Portugal', 'Spain', 'Gibraltar', 'Bhutan', 'Saudi Arabia',
       'Bahrain', 'Iran', 'Belgium', 'Luxembourg', 'Czech Republic',
       'Isle of Man', 'Bulgaria', 'Romania', 'Austria', 'Greece',
       'Serbia', 'Malta', 'France', 'Sweden', 'Rwanda', 'Finland',
       'Hungary', 'Estonia', 'Cyprus', 'Switzerland', 'Seychelles',
       'Malawi', 'Lesotho', 'Swaziland', 'Sierra Leone', 'Tanzania',
       'Mozambique', 'Cameroon', 'Belize', 'Bahamas', 'Argentina',
       'Panama', 'Israel', 'Turkey', 'Croatia', 'Slovenia',
       'Cook Islands', 'Fiji', 'Samoa', 'Japan', 'Indonesia',
       'South Korea', 'Mali', 'St Helena', 'Gambia', 'Eswatini', 'China',
       'Myanmar', 'Mongolia', 'Chile', 'Mexico', 'Cambodia'], dtype=object)

In [4]:
df.columns

Index(['Unnamed: 0', 'match_id', 'season', 'start_date', 'venue', 'innings',
       'ball', 'batting_team', 'bowling_team', 'striker', 'non_striker',
       'bowler', 'runs_off_bat', 'extras', 'wides', 'noballs', 'byes',
       'legbyes', 'penalty', 'wicket_type', 'player_dismissed'],
      dtype='object')

In [5]:
seasons = ['2021/22', '2022/23', '2023/24']

recent_seasons = df.loc[df['season'].isin(seasons)]

In [6]:
_df = (recent_seasons
       .loc[:, ['striker', 'runs_off_bat', 'extras']]
       .groupby(['striker'], as_index = False)
       .sum())

In [7]:
_df_sorted = _df.sort_values(by='runs_off_bat', ascending=False)
_df_sorted

              striker  runs_off_bat  extras
1175         SA Yadav          1261      34
884   Mohammad Rizwan          1157      59
1399  Waseem Muhammad          1071      53
234        Babar Azam          1011      40
601        JC Buttler           916      41
...               ...           ...     ...
1183         SI Kamea             0       1
1290           T Hewa             0       0
610        JF Chester             0       0
1292      T Lungameni             0       0
498          HR Walsh             0       1

[1447 rows x 3 columns]

In [8]:
num_bowls = (df
       .loc[:, ['striker', 'bowling_team', 'batting_team']]
       .groupby(['striker', 'batting_team'], as_index = False)
       .count()
       .rename(columns = {'bowling_team' : 'n_bowls'}))

In [9]:
df2 = _df.merge(num_bowls, on = ['striker'])

df2

               striker  runs_off_bat  extras  batting_team  n_bowls
0          A Balbirnie           600      17       Ireland     1692
1             A Bohara             5       0         Nepal       28
2          A Chaudhary            42       9     Singapore       42
3             A Conteh            35       6        Gambia       58
4            A Dhingra             1       0    Luxembourg        8
...                ...           ...     ...           ...      ...
1474      Zhuang Zelin             0       0         China       61
1475      Zong Yuechao             0       0         China       23
1476           Zou Kui             0       2         China        5
1477  Zubaidi Zulkifle           406      18      Malaysia      512
1478   Zuhair Muhammad             7       2  Saudi Arabia       18

[1479 rows x 5 columns]

In [10]:
df2['runs_per_bowl'] = (df2['runs_off_bat'] + df2['extras']) / df2['n_bowls']
df2['weighted_runs_per_bowl'] = df2['runs_per_bowl'] * df2['n_bowls']
df2.sort_values(by = 'weighted_runs_per_bowl', ascending = False)

,striker,runs_off_bat,extras,batting_team,n_bowls,runs_per_bowl,weighted_runs_per_bowl
1200,SA Yadav,1261,34,India,1296,0.999228,1295.0
904,Mohammad Rizwan,1157,59,Pakistan,2405,0.505613,1216.0
1430,Waseem Muhammad,1071,53,United Arab Emirates,950,1.183158,1124.0
238,Babar Azam,1011,40,Pakistan,2943,0.357119,1051.0
614,JC Buttler,916,41,England,2086,0.458773,957.0
...,...,...,...,...,...,...,...
1239,SVE Bharathi,0,0,Germany,17,0.000000,0.0
158,Ammar Zuhdi Hazalan,0,0,Malaysia,3,0.000000,0.0
1255,Sana Ullah,0,0,South Korea,2,0.000000,0.0
325,D Maisuria,0,0,Botswana,70,0.000000,0.0
58,AC Evans,0,0,Scotland,18,0.000000,0.0

In [11]:
us = df2[df2['batting_team'] == 'United States of America']


us.sort_values(by = 'weighted_runs_per_bowl', ascending = False)

,striker,runs_off_bat,extras,batting_team,n_bowls,runs_per_bowl,weighted_runs_per_bowl
448,G Singh,137,18,United States of America,134,1.156716,155.0
107,Aaron Jones,116,4,United States of America,273,0.439560,120.0
1230,SR Taylor,82,10,United States of America,199,0.462312,92.0
820,MD Patel,79,2,United States of America,224,0.361607,81.0
1210,SJ Modani,77,4,United States of America,71,1.140845,81.0
1436,XM Marshall,78,2,United States of America,185,0.432432,80.0
541,IG Holland,47,8,United States of America,54,1.018519,55.0
845,MO Kain,50,2,United States of America,50,1.040000,52.0
669,K Gore,43,8,United States of America,32,1.593750,51.0
649,JS Malhotra,50,1,United States of America,219,0.232877,51.0
961,NK Patel,40,1,United States of America,95,0.431579,41.0
1115,RM Scott,19,2,United States of America,20,1.050000,21.0
1122,RR Behera,16,2,United States of America,28,0.642857,18.0
1219,SN Netravalkar,7,2,United States of America,37,0.243243,9.0
607,J Theron,8,0,United States of America,6,1.333333,8.0
145,Ali Khan,0,2,United States of America,2,1.000000,2.0
506,HR Walsh,0,1,United States of America,111,0.009009,1.0
1451,Yasir Mohammad,0,1,United States of America,28,0.035714,1.0